CSI API ETABS v1
cPointObj.GetGroupAssign Method
 Retrieves the groups to which a point object is assigned.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetGroupAssign(
	string Name,
	ref int NumberGroups,
	ref string[] Groups
)
Function GetGroupAssign (
	Name As String,
	ByRef NumberGroups As Integer,
	ByRef Groups As String()
) As Integer
Dim instance As cPointObj
Dim Name As String
Dim NumberGroups As Integer
Dim Groups As String()
Dim returnValue As Integer
returnValue = instance.GetGroupAssign(Name,
	NumberGroups, Groups)
int GetGroupAssign(
	String^ Name,
	int% NumberGroups,
	array<String^>^% Groups
)
abstract GetGroupAssign :
        Name : string *
        NumberGroups : int byref *
        Groups : string[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing point object.
NumberGroups
Type: System.Int32
 The number of group names retrieved.
Groups
Type: System.String[]
 This is an array of the names of the groups to which the point object is assigned.
Return Value
Type: Int32
 Returns zero if the group assignments are successfully retrieved, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim NumberGroups As Integer
       Dim Groups() as String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
   'define new groups
       ret = SapModel.GroupDef.SetGroup("Group1")
       ret = SapModel.GroupDef.SetGroup("Group2")
   'add point object to groups
       ret = SapModel.PointObj.SetGroupAssign("3", "Group1")
       ret = SapModel.PointObj.SetGroupAssign("3", "Group2")
   'get point object groups
       ret = SapModel.PointObj.GetGroupAssign("3", NumberGroups, Groups)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPointObj Interface
ETABSv1 Namespace